#1, 파이썬의 장점과 단점 - 오픈소스, 문법이 쉬워 빠르게 배울수 있다, 간결 가독성 좋다
#                                               동적 타이핑 라이브러리가 풍부하다.
#                 파이썬의 단점- 연산속도가 느리다 모바일기기 활용이 어렵다(앱개발X)
# 2.키워드 - 예약어 특징 종류
# 3. tutle 모듈
# 4. 연산자 - 산술연산자, 대입연산자, 비교연산자,논리연산자
#                      산술: + - * / // % **
#                      대입: = + = - = * = /= //= % = ** =
#                      비교: < > > = < = != ==      => 답은 True False 중의 하나 
#                      논리: and or not                => 답은 True False 중의 하나 
# 5.변수 : 데이터 담는 장소 의미있는 단어로 이름 짓기 동적타이핑 
#                변수이름 - 예악어 사용안됨, 숫자로 시작 안됨 밑줄 줄문자 많이 사용(_) 대소구분
# 6. 이스케이프코드 -  \n \t \\ \' \'' 설명 같이 알아두기
# 7. 문자열 슬라이싱
"""
s = "inpyung high school" # high만 가져올때 인덱싱 공백도 포함
print(s[8:12])
"""
# 8. 컨테이너 변수 - 여러개의 값을 가지는 변수(리스트 튜플 딕셔너리 셋)
# 9. 리스트 변수의 특징 -  여려개의 갑을 가질 수 있다 [ ] 로 구분
#                                              값을 수정 삽입(insert) 추가(append) 삭제가 가능 
#                                              각각의 요소에 접근해 인덱싱 슬라이싱 가능
#                                             
s = [1, 2, 3, 4, 5]
print(s[2:4])  #리스트 변수 슬라이싱
s[0] = 7 # 리스트 값 수정  
s.insert(3,9)  # 리스트 값 삽입 에스점 인서트
s.append(18) # 리스트 값 추가 
print(s)
#10. import random 난수 발생 모듈 
#11. if문 - 홀짝판별
#12. while문 무한반복일때 프로그램 종료시키는 방법 : break
#                       프로그램 안에서 종료 조건이 있어야 함

x= 3
while x <6:
      print(x)
      break

#13. for문 3배수 출력
#14. for문 구구단 찍기

